# BoundaryConditionFamilySymbolPinned Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSettings..::..BoundaryConditionFamilySymbolPinned Property
StructuralSettings Class See Also
---
The id of the FamilySymbol to represent a pinned boundary condition.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId BoundaryConditionFamilySymbolPinned { get; set; }
```

Visual Basic
---
```text
Public Property BoundaryConditionFamilySymbolPinned As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ BoundaryConditionFamilySymbolPinned {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace